salesorder/src/test/resources/de/home24/middleware/salesorderservice/Request_UpdateSalesOrderLine_CallFromCarrierStatusProcess.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	</soap:Header>
	<soapenv:Body>
		<v1:updateSalesOrderLineRequest
			xmlns:v1="http://home24.de/interfaces/bas/salesorderservice/salesorderservicemessages/v1"
			xmlns:v11="http://home24.de/data/common/messageheadertypes/v1"
			xmlns:tns="http://www.openapplications.org/oagis/10">
			<v1:requestHeader/>
			<v1:salesOrder typeCode="token" actionCode="token">
				<tns:SalesOrderHeader>
					<tns:ID>1231376876</tns:ID>
				</tns:SalesOrderHeader>
				<tns:SalesOrderLine>
					<tns:LineNumberID>10000</tns:LineNumberID>
					<tns:Item>
						<tns:Packaging>
							<tns:ID>44444</tns:ID>
							<tns:Note typeCode="Status" status="XTrace.Event.CurrierStatusCode_1"
								entryDateTime="2015-12-09T11:13:09.38+01:00">XTrace.Event.CurrierStatus_1</tns:Note>
						</tns:Packaging>
						<tns:Packaging>
							<tns:ID>55555</tns:ID>
							<tns:Note typeCode="Status" status="XTrace.Event.CurrierStatusCode_2"
								entryDateTime="2015-12-09T11:13:09.38+01:00">XTrace.Event.CurrierStatus_2</tns:Note>
						</tns:Packaging>
					</tns:Item>
				</tns:SalesOrderLine>
				<tns:SalesOrderLine>
					<tns:LineNumberID>20000</tns:LineNumberID>
					<tns:Item>
						<tns:Packaging>
							<tns:ID>66666</tns:ID>
							<tns:Note typeCode="Status" status="XTrace.Event.CurrierStatusCode_3"
								entryDateTime="2015-12-09T11:13:09.38+01:00">XTrace.Event.CurrierStatus_3</tns:Note>
						</tns:Packaging>
						<tns:Packaging>
							<tns:ID>77777</tns:ID>
							<tns:Note typeCode="Status" status="XTrace.Event.CurrierStatusCode_4"
								entryDateTime="2015-12-09T11:13:09.38+01:00">XTrace.Event.CurrierStatus_4</tns:Note>
						</tns:Packaging>
					</tns:Item>
				</tns:SalesOrderLine>
			</v1:salesOrder>
		</v1:updateSalesOrderLineRequest>
	</soapenv:Body>
</soapenv:Envelope>
